# Icss - Userbot
# من هنا يتم تحميل المتحركات
# gif loaded from here

T = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه اوامر المتحركات :**\n"
    "⪼ `.متحركات تمبلر`\n"
    "⪼ `.متحركات كيوت`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

O = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات تمبلر :**\n"
    "⪼ `.ت1`\n"
    "⪼ `.ت2`\n"
    "⪼ `.ت3`\n"
    "⪼ `.ت4`\n"
    "⪼ `.ت5`\n"
    "⪼ `.ت6`\n"
    "⪼ `.ت7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

S = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات كيوت :**\n"
    "⪼ `.ك1`\n"
    "⪼ `.ك2`\n"
    "⪼ `.ك3`\n"
    "⪼ `.ك4`\n"
    "⪼ `.ك5`\n"
    "⪼ `.ك6`\n"
    "⪼ `.ك7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

H = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات جريئـه :**\n"
    "⪼ `.ج1`\n"
    "⪼ `.ج2`\n"
    "⪼ `.ج3`\n"
    "⪼ `.ج4`\n"
    "⪼ `.ج5`\n"
    "⪼ `.ج6`\n"
    "⪼ `.ج7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

A = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات تحشيش :**\n"
    "⪼ `.ح1`\n"
    "⪼ `.ح2`\n"
    "⪼ `.ح3`\n"
    "⪼ `.ح4`\n"
    "⪼ `.ح5`\n"
    "⪼ `.ح6`\n"
    "⪼ `.ح7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

KUTTE = "𓆩 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑼𝑻𝑬 𝑮𝑰𝑭 𓆪"
kut_gif = "https://telegra.ph/file/eea08954a3f302fc9add0.mp4"
kut_gif2 = "https://telegra.ph/file/834d5db098aacb76f91dd.mp4" 
kut_gif3 = "https://telegra.ph/file/78185fe07950955f07e74.mp4"
kut_gif4 = "https://telegra.ph/file/dccf11fffd3abda4a4f29.mp4"
kut_gif5 = "https://telegra.ph/file/48c31877954d9fb53ee1f.mp4"
kut_gif6 = "https://telegra.ph/file/c7fe5c6b44a09754ad5c8.mp4"
kut_gif7 = "https://telegra.ph/file/787f0c1d759a8b4faa0fc.mp4"
TMTE = "𓆩𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑻𝑼𝑴𝑩𝑳𝑹 𝑮𝑰𝑭𓆪"
tm_gif = "https://telegra.ph/file/0f57dc58339a693ae3db2.mp4"
tm_gif2 = "https://telegra.ph/file/6e707dc14cb918cd765fb.mp4"
tm_gif3 = "https://telegra.ph/file/ecf8aa1a881954a9ed196.mp4"
tm_gif4 = "https://telegra.ph/file/dccf11fffd3abda4a4f29.mp4"
tm_gif5 = "https://telegra.ph/file/4e6d2784767f22c707883.mp4"
tm_gif6 = "https://telegra.ph/file/7fa9b1905df5840c7c77a.mp4"
tm_gif7 = "https://telegra.ph/file/6efa916e79bdf7fe3fba4.mp4"
