"""
©icss : @rruuurr
  - Commends of All Gif
"""

T = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه اوامر المتحركات :**\n"
    "⪼ `.متحركات تمبلر`\n"
    "⪼ `.متحركات كيوت`\n"
    "⪼ `.متحركات تحشيش`\n"
    "⪼ `.متحركات جريئه`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

O = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات تمبلر :**\n"
    "⪼ `.ت1`\n"
    "⪼ `.ت2`\n"
    "⪼ `.ت3`\n"
    "⪼ `.ت4`\n"
    "⪼ `.ت5`\n"
    "⪼ `.ت6`\n"
    "⪼ `.ت7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

S = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات كيوت :**\n"
    "⪼ `.ك1`\n"
    "⪼ `.ك2`\n"
    "⪼ `.ك3`\n"
    "⪼ `.ك4`\n"
    "⪼ `.ك5`\n"
    "⪼ `.ك6`\n"
    "⪼ `.ك7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

H = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات جريئـه :**\n"
    "⪼ `.ج1`\n"
    "⪼ `.ج2`\n"
    "⪼ `.ج3`\n"
    "⪼ `.ج4`\n"
    "⪼ `.ج5`\n"
    "⪼ `.ج6`\n"
    "⪼ `.ج7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

A = (
    "𓆰 𝑺𝑶𝑼𝑹𝑪𝑬 𝑰𝑪𝑺𝑺 - 𝑪𝑶𝑴𝑴𝑨𝑵𝑫𝑺 𓆪\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "**⌔∮ قائـمه متحركات تحشيش :**\n"
    "⪼ `.ح1`\n"
    "⪼ `.ح2`\n"
    "⪼ `.ح3`\n"
    "⪼ `.ح4`\n"
    "⪼ `.ح5`\n"
    "⪼ `.ح6`\n"
    "⪼ `.ح7`\n"
    "𓍹ⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧⵧ𓍻\n"
    "𓆩 𝙎𝙊𝙐𝙍𝘾𝞝 𝙞𝘾𝙎𝙎 - [𝘿𝙀𝙑](t.me/rruuurr) 𓆪"
)

@icssbot.on(icss_cmd(pattern="م20"))
async def icss(tosh):
    return await eor(tosh, T)

@icssbot.on(icss_cmd(pattern="متحركات تمبلر"))
async def icss(tosh):
    return await eor(tosh, O)

@icssbot.on(icss_cmd(pattern="متحركات كيوت"))
async def icss(tosh):
    return await eor(tosh, S)

@icssbot.on(icss_cmd(pattern="متحركات جريئه"))
async def icss(tosh):
    return await eor(tosh, H)

@icssbot.on(icss_cmd(pattern="متحركات تحشيش"))
async def icss(tosh):
    return await eor(tosh, A)




